In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('data/titles.csv')
titles.head()

             title  year
0   Orlando Vargas  2005
1         Niu-Peng  1989
2    Anandabhadram  2005
3   Mahendra Varma  1993
4  Beomdiga shidae  1970

In [5]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

### How many movies are listed in the titles dataframe?

There are multiple ways to do that

In [6]:
titles.shape[0]

214591

In [12]:
titles.size//len(titles.columns)

214591

In [9]:
titles.index.size

214591

In [13]:
len(titles)

214591

### What are the earliest two films listed in the titles dataframe?

In [15]:
titles.sort_values(['year'], ascending=True).iloc[:2]

                                                   title  year
90767                                         Miss Jerry  1894
10994  Reproduction of the Corbett and Fitzsimmons Fight  1897

In [16]:
titles.sort_values(['year'], ascending=True).head(2)

                                                   title  year
90767                                         Miss Jerry  1894
10994  Reproduction of the Corbett and Fitzsimmons Fight  1897

### How many movies have the title "Hamlet"?

In [18]:
ham = titles[titles.title == 'Hamlet']
len(ham)
ham.shape[0]

19

19

In [20]:
haml = titles.loc[titles.title == 'Hamlet']
len(haml)
haml.shape[0]

19

19

In [21]:
# I forgot about this method this time

# What does the '==' return? A big list of trues or falses. Basically 0s and 1s.

# So we only need to do this

sum(titles.title == 'Hamlet')

19

### How many movies are titled "North by Northwest"?

In [29]:
%%time

sum(titles.title == 'North by Northwest')

Wall time: 27.2 ms

1

In [30]:
%%time 
titles[titles.title == 'North by Northwest'].shape[0]

Wall time: 11 ms

1

### When was the first movie titled "Hamlet" made?

In [33]:
ham.sort_values(['year']).head()

         title  year
100923  Hamlet  1910
179411  Hamlet  1911
85485   Hamlet  1913
139892  Hamlet  1921
156599  Hamlet  1948

In [34]:
ham.sort_values(['year']).head(1).year

100923    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [41]:
titles[titles.title == 'Treasure Island'].sort_values('year')

                  title  year
48904   Treasure Island  1918
108475  Treasure Island  1920
89471   Treasure Island  1934
52435   Treasure Island  1950
118309  Treasure Island  1972
144139  Treasure Island  1973
191845  Treasure Island  1985
50325   Treasure Island  1999

### How many movies were made in the year 1950?

In [37]:
titles[titles.year == 1950]

                           title  year
43                         Aawaz  1956
50               Sahildeki kadin  1954
60      Everything But the Truth  1956
71            La negra Angustias  1950
76              Kinder der Berge  1958
...                          ...   ...
214496              Easy to Love  1953
214499                 Ates Riza  1958
214525            Darbar-E-Habib  1956
214562              Saltimbancos  1951
214580         The Ugly Duckling  1959

[12110 rows x 2 columns]

In [44]:
titles[titles.year == 1950].shape
len(titles[titles.year == 1950])

(1036, 2)

1036

### How many movies were made in the year 1960?

In [42]:
titles[titles.year == 1960].shape
len(titles[titles.year == 1960])

(1461, 2)

1461

### How many movies were made from 1950 through 1959?

In [43]:
titles[titles.year//10 == 195].shape
len(titles[titles.year//10 == 195])

(12110, 2)

12110

### In what years has a movie titled "Batman" been released?

In [45]:
titles[titles.title == 'Batman']

        title  year
16656  Batman  1989
56309  Batman  1943

### How many roles were there in the movie "Inception"?

In [48]:
cast[cast.title == 'Inception']

,title,year,name,type,character,n
85565,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
130207,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
161273,Inception,2010,Tom Berenger,actor,Browning,8.0
173593,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
228660,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
2972865,Inception,2010,Ellen Page,actress,Ariadne,3.0
3021835,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3045839,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3051953,Inception,2010,Talulah Riley,actress,Blonde,25.0
3265183,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [51]:
cast[cast.title == 'Inception'].character.drop_duplicates().size

51

In [62]:
inc = cast[cast.title == 'Inception']#.character
inc[inc.duplicated(['character'], keep = False)]
inc[inc.duplicated(['character'], keep = 'first')].shape

             title  year                  name     type        character     n
85565    Inception  2010  Michael (III) August    actor    LAX Passenger   NaN
228660   Inception  2010        Virgile Bramly    actor   Bridge Sub Con  29.0
331411   Inception  2010         John Ceallach    actor    LAX Passenger   NaN
383230   Inception  2010         Nicolas Clerc    actor   Bridge Sub Con  26.0
392820   Inception  2010        Adam (IV) Cole    actor      Bar Sub Con  34.0
458599   Inception  2010    Jean-Michel Dagory    actor   Bridge Sub Con  30.0
654560   Inception  2010      Mark Fleischmann    actor  Penrose Sub Con  32.0
738646   Inception  2010         Carl Gilliard    actor    Lobby Sub Con  40.0
742450   Inception  2010     Daniel Girondeaud    actor   Bridge Sub Con   NaN
894946   Inception  2010       Andrew Hoagland    actor       Pedestrian   NaN
1437263  Inception  2010     Jack (III) Murray    actor      Bar Sub Con  35.0
1607678  Inception  2010        Andrew Pleavin    actor      Businessman  47.0
1629230  Inception  2010          Scott Pretty    actor       Pedestrian   NaN
1651192  Inception  2010          Marc Raducci    actor    Lobby Sub Con  39.0
1704026  Inception  2010   Benjamin (II) Riley    actor   Bridge Sub Con   NaN
1773479  Inception  2010         Norman Saleet    actor   Airport Patron   NaN
1817012  Inception  2010           Felix Scott    actor      Businessman  46.0
1885046  Inception  2010     Colin (XXV) Smith    actor   Airport Patron   NaN
2008502  Inception  2010        Kraig Thornber    actor      Bar Sub Con  36.0
2312415  Inception  2010      Natasha Beaumont  actress      Bar Sub Con  38.0
2451229  Inception  2010       Helena Cullinan  actress  Penrose Sub Con  31.0
2478051  Inception  2010      Coralie Dedykere  actress   Bridge Sub Con  27.0
2601094  Inception  2010       Natalie Goldwin  actress    LAX Passenger   NaN
2771934  Inception  2010         Silvie Laguna  actress   Bridge Sub Con  28.0
2777976  Inception  2010          Shelley Lang  actress  Penrose Sub Con  33.0
2816199  Inception  2010     Alex (II) Lombard  actress    Lobby Sub Con  42.0
2835312  Inception  2010         Jill Maddrell  actress    Lobby Sub Con  41.0
2935718  Inception  2010      Angela Nathenson  actress      Bar Sub Con  37.0
3021835  Inception  2010        Nicole Pulliam  actress    Lobby Sub Con  43.0

(21, 6)

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?